&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
    Объект.УпаковкаПересчет = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) ТОГДА
		Объект.БазоваяПересчет = ПолучитьБазовуюЕдиницуНаСервере(Объект.Номенклатура)
	КонецЕсли;
	
КонецПроцедуры

 &НаСервереБезКонтекста
 Функция ПолучитьБазовуюЕдиницуНаСервере(Знач СсылкаНаНоменклатуру)
	 
	 Возврат СсылкаНаНоменклатуру.БазоваяЕдиницаИзмерения;
	 
КонецФункции