
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Объект.ТекущееПодразделение = ПолучитьПодразделениеПользователя(Объект.Пользователь);
		Объект.ТекущаяДолжность = ПолучитьДолжностьПользователя(Объект.Пользователь);
	Иначе	
	    Объект.ТекущееПодразделение = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Объект.ТекущаяДолжность = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодразделениеПользователя(Знач ВыбранныйПользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ВыбранныйПользователь";
		
	Запрос.УстановитьПараметр("ВыбранныйПользователь", ВыбранныйПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Подразделение;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДолжностьПользователя(Знач ВыбранныйПользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Должность КАК Должность
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ВыбранныйПользователь";
		
	Запрос.УстановитьПараметр("ВыбранныйПользователь", ВыбранныйПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Должность;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");
КонецФункции

&НаКлиенте
Процедура НоваяДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.НовоеПодразделение) Тогда
		СтандартнаяОбработка = Ложь; 
		
		СтруктураОтбора = Новый Структура("НовоеПодразделение", Объект.НовоеПодразделение); 
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
		ОткрытьФорму("Справочник.Должности.ФормаВыбора", ПараметрыОткрытия, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовоеПодразделениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.НоваяДолжность) Тогда
		Объект.НоваяДолжность = "";
	КонецЕсли;
КонецПроцедуры

