&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//фильтрация для Справочник.Пользователи
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Подразделение") Тогда
		ЗначениеПодразделения = Параметры.Отбор.Подразделение;
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
				И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
				ЭлементыОтбора.Удалить(ЭлементОтбора);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Подразделение");
		НовыйЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = ЗначениеПодразделения;
		НовыйЭлемент.Использование  = Истина;
		
		НовыйЭлемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	//фильтрация для Документ.КадровоеПеремещение
	ИначеЕсли Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("НовоеПодразделение") Тогда
		ЗначениеНовогоПодразделения = Параметры.Отбор.НовоеПодразделение;
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
				И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
				ЭлементыОтбора.Удалить(ЭлементОтбора);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Подразделение");
		НовыйЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = ЗначениеНовогоПодразделения;
		НовыйЭлемент.Использование  = Истина;
		
		НовыйЭлемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;				
КонецПроцедуры
