
&НаКлиенте
Процедура ОпытРаботыДатаОкончанияПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ОпытРаботы.ТекущиеДанные;
	
	Если (ТекущаяСтрока.ДатаНачала > ТекущаяСтрока.ДатаОкончания) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) Тогда
		Сообщить("Дата начала не может быть позже даты окончания!");
	Иначе
		ТекущаяСтрока.Срок = РасчетСрокаРаботы(ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаНачалаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ОпытРаботы.ТекущиеДанные;
	
	Если (ТекущаяСтрока.ДатаНачала > ТекущаяСтрока.ДатаОкончания) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончания) Тогда
		Сообщить("Дата начала не может быть позже даты окончания!");
	Иначе
		ТекущаяСтрока.Срок = РасчетСрокаРаботы(ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		СтандартнаяОбработка = Ложь; 
		
		СтруктураОтбора = Новый Структура("Подразделение", Объект.Подразделение); 
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
		ОткрытьФорму("Справочник.Должности.ФормаВыбора", ПараметрыОткрытия, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыЗаписи.Вставить("ЭтоНовыйЭлемент", Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчетСрокаРаботы(Знач ДатаНачала, Знач ДатаОкончания)
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат "";
	КонецЕсли;
	
	РезультатРасчета = РассчитатьКоличествоЛетИМесяцев(ДатаНачала, ДатаОкончания);
	
	КоличествоЛет = РезультатРасчета.Лет;
	КоличествоМесяцев = РезультатРасчета.Месяцев;
	
	СклонениеЛет = СформироватьСклонениеЛет(КоличествоЛет);
	СклонениеМесяцев = СформироватьСклонениеМесяцев(КоличествоМесяцев);
	
	Результат = "" + КоличествоЛет + " " + СклонениеЛет + " " + КоличествоМесяцев + " " + СклонениеМесяцев;
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьКоличествоЛетИМесяцев(Знач ДатаНачала, Знач ДатаОкончания)
	КоличествоЛет = Год(ДатаОкончания) - Год(ДатаНачала);
	КоличествоМесяцев = Месяц(ДатаОкончания) - Месяц(ДатаНачала);
	
	Если День(ДатаОкончания) < День(ДатаНачала) Тогда
		КоличествоМесяцев = КоличествоМесяцев - 1;
	КонецЕсли;
	
	Если КоличествоМесяцев < 0 Тогда
		КоличествоЛет = КоличествоЛет - 1;
		КоличествоМесяцев = КоличествоМесяцев + 12;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Лет", КоличествоЛет);
	Результат.Вставить("Месяцев", КоличествоМесяцев);
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСклонениеЛет(Знач Число)
	Склонение = "";
	
	Если (Число > 1) и (Число < 5) Тогда
		Склонение = "года";
	ИначеЕсли (Число = 1) Тогда
		Склонение = "Год";
	ИначеЕсли (Число > 4) Тогда
		Склонение = "лет";
	КонецЕсли;
	
	Возврат Склонение;
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСклонениеМесяцев(Знач Число)
	Склонение = "";
	
	Если (Число > 1) и (Число < 5) Тогда
		Склонение = "месяца";
	ИначеЕсли (Число = 1) Тогда
		Склонение = "месяц";
	ИначеЕсли (Число > 4) Тогда
		Склонение = "месяцев";
	КонецЕсли; 
	
	Возврат Склонение;
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Объект.Должность = "";
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Оклад = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле Оклад обязательно для заполнения!";
		Сообщение.Поле = "Объект.Оклад"; 
		Сообщение.Сообщить();
		
		Отказ = Истина; 
		Возврат;        
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ЭтоНовыйЭлемент") Тогда
		ТекущийОбъект.Записать(); 
		
		НовыйДокумент = Документы.ПриемНаРаботу.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		
		НовыйДокумент.Пользователь   = ТекущийОбъект.Ссылка; 
		НовыйДокумент.Подразделение  = ТекущийОбъект.Подразделение;
		НовыйДокумент.Должность      = ТекущийОбъект.Должность;
		НовыйДокумент.Оклад          = ТекущийОбъект.Оклад;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ Прием на работу успешно создан и проведен!";
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось автоматически сформировать документ Прием на работу! Ошибка: " + ОписаниеОшибки();
			Сообщение.Сообщить();
			
			Отказ = Истина; 
		КонецПопытки;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Должность) Тогда
		Объект.Оклад = ПолучитьОкладПоДолжности(Объект.Должность);
	Иначе	
	    Объект.Оклад = ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОкладПоДолжности(Знач ВыбраннаяДолжность)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.Оклад КАК Оклад
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Ссылка = &ВыбраннаяДолжность";
		
	Запрос.УстановитьПараметр("ВыбраннаяДолжность", ВыбраннаяДолжность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Оклад;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");
КонецФункции





